Ran Plan for dir: `deployment/cloud` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.gce_atlantis.local_file.ansible_vars[0] will be created
+ resource "local_file" "ansible_vars" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "ansible/atlantis/ansible_vars.json"
      + id                   = (known after apply)
    }

  # module.gce_atlantis.local_file.private_key will be created
+ resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0700"
      + file_permission      = "0400"
      + filename             = "ansible/atlantis/id_rsa.pem"
      + id                   = (known after apply)
    }

  # module.gke_main.google_container_cluster.cluster will be created
+ resource "google_container_cluster" "cluster" {
      + cluster_ipv4_cidr                        = (known after apply)
      + datapath_provider                        = "ADVANCED_DATAPATH"
      + default_max_pods_per_node                = (known after apply)
      + deletion_protection                      = false
      + effective_labels                         = {
          + "code"                       = "gke"
          + "env"                        = "mstr"
          + "feature"                    = "main"
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "fta-mstr-gke-main"
          + "unit"                       = "fta"
        }
      + enable_cilium_clusterwide_network_policy = false
      + enable_intranode_visibility              = (known after apply)
      + enable_kubernetes_alpha                  = false
      + enable_l4_ilb_subsetting                 = false
      + enable_legacy_abac                       = false
      + enable_multi_networking                  = false
      + enable_shielded_nodes                    = true
      + endpoint                                 = (known after apply)
      + id                                       = (known after apply)
      + initial_node_count                       = 1
      + label_fingerprint                        = (known after apply)
      + location                                 = "asia-southeast2-a"
      + logging_service                          = (known after apply)
      + master_version                           = (known after apply)
      + monitoring_service                       = (known after apply)
      + name                                     = "fta-mstr-gke-main"
      + network                                  = "https://www.googleapis.com/compute/v1/projects/fta-platform/global/networks/fta-mstr-vpc-main"
      + networking_mode                          = (known after apply)
      + node_locations                           = (known after apply)
      + node_version                             = (known after apply)
      + operation                                = (known after apply)
      + private_ipv6_google_access               = (known after apply)
      + project                                  = (known after apply)
      + remove_default_node_pool                 = true
      + resource_labels                          = {
          + "code"    = "gke"
          + "env"     = "mstr"
          + "feature" = "main"
          + "name"    = "fta-mstr-gke-main"
          + "unit"    = "fta"
        }
      + self_link                                = (known after apply)
      + services_ipv4_cidr                       = (known after apply)
      + subnetwork                               = "https://www.googleapis.com/compute/v1/projects/fta-platform/regions/asia-southeast2/subnetworks/fta-mstr-vpc-main-subnet"
      + terraform_labels                         = {
          + "code"                       = "gke"
          + "env"                        = "mstr"
          + "feature"                    = "main"
          + "goog-terraform-provisioned" = "true"
          + "name"                       = "fta-mstr-gke-main"
          + "unit"                       = "fta"
        }
      + tpu_ipv4_cidr_block                      = (known after apply)

      + addons_config (known after apply)

      + authenticator_groups_config (known after apply)

      + binary_authorization {
          + evaluation_mode = "PROJECT_SINGLETON_POLICY_ENFORCE"
        }

      + cluster_autoscaling {
          + auto_provisioning_locations = (known after apply)
          + autoscaling_profile         = "BALANCED"
          + enabled                     = false

          + auto_provisioning_defaults (known after apply)
        }

      + confidential_nodes (known after apply)

      + cost_management_config (known after apply)

      + database_encryption (known after apply)

      + default_snat_status (known after apply)

      + dns_config {
          + cluster_dns        = "CLOUD_DNS"
          + cluster_dns_domain = "gke.fta.blast.co.id"
          + cluster_dns_scope  = "VPC_SCOPE"
        }

      + gateway_api_config (known after apply)

      + identity_service_config (known after apply)

      + ip_allocation_policy {
          + cluster_ipv4_cidr_block       = (known after apply)
          + cluster_secondary_range_name  = "pods-range"
          + services_ipv4_cidr_block      = (known after apply)
          + services_secondary_range_name = "services-range"
          + stack_type                    = "IPV4"

          + pod_cidr_overprovision_config (known after apply)
        }

      + logging_config (known after apply)

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + master_authorized_networks_config {
          + gcp_public_cidrs_access_enabled = false

          + cidr_blocks {
              + cidr_block   = "202.165.33.0/24"
              + display_name = "my-home-public-ip"
            }
        }

      + mesh_certificates (known after apply)

      + monitoring_config (known after apply)

      + node_config (known after apply)

      + node_pool (known after apply)

      + node_pool_auto_config (known after apply)

      + node_pool_defaults (known after apply)

      + notification_config (known after apply)

      + private_cluster_config {
          + enable_private_nodes   = true
          + master_ipv4_cidr_block = "192.168.0.0/28"
          + peering_name           = (known after apply)
          + private_endpoint       = (known after apply)
          + public_endpoint        = (known after apply)

          + master_global_access_config (known after apply)
        }

      + release_channel (known after apply)

      + security_posture_config (known after apply)

      + service_external_ips_config (known after apply)

      + vertical_pod_autoscaling (known after apply)

      + workload_identity_config {
          + workload_pool = "fta-platform.svc.id.goog"
        }
    }

  # module.gke_main.google_container_node_pool.nodepool["spot"] will be created
+ resource "google_container_node_pool" "nodepool" {
      + cluster                     = "fta-mstr-gke-main"
      + id                          = (known after apply)
      + initial_node_count          = (known after apply)
      + instance_group_urls         = (known after apply)
      + location                    = "asia-southeast2-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "spot"
      + name_prefix                 = (known after apply)
      + node_count                  = 2
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = "fta-platform"
      + version                     = (known after apply)

      + autoscaling {
          + location_policy = "ANY"
          + max_node_count  = 20
          + min_node_count  = 2
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + network_config (known after apply)

      + node_config {
          + disk_size_gb     = 20
          + disk_type        = "pd-standard"
          + effective_taints = (known after apply)
          + image_type       = (known after apply)
          + labels           = {
              + "code"    = "gke"
              + "env"     = "mstr"
              + "feature" = "main"
              + "name"    = "fta-mstr-gke-main-np-spot"
              + "type"    = "spot"
              + "unit"    = "fta"
            }
          + local_ssd_count  = (known after apply)
          + logging_variant  = (known after apply)
          + machine_type     = "e2-medium"
          + metadata         = (known after apply)
          + min_cpu_platform = (known after apply)
          + oauth_scopes     = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible      = false
          + service_account  = "781497044301-compute@developer.gserviceaccount.com"
          + spot             = false
          + tags             = [
              + "spot",
            ]

          + confidential_nodes (known after apply)

          + guest_accelerator (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = false
              + enable_secure_boot          = true
            }

          + workload_metadata_config (known after apply)
        }

      + upgrade_settings (known after apply)
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d deployment/cloud
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://fta-mstr-gce-atlantis:4141/lock?id=greyhats13%252Ffta_iac%252Fdeployment%252Fcloud%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d deployment/cloud
  ```
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```